[
  {
    "slug": "the-elevator-1",
    "title_en": "The Elevator",
    "surface_en": "I walked into the elevator ready to go to school. As the elevator rose, I knew I could never make it to school again.",
    "solution_en": "On Monday morning, urged by my mom, I sleepily entered the elevator. Still groggy, I forgot to press the button for the first floor. The elevator kept rising. Just as I realized my mistake and was about to press the button, it suddenly stopped. The doors opened slowly—there was a girl lying in a pool of blood, and a man was cleaning up the scene…"
  },
  {
    "slug": "the-black-cat-2",
    "title_en": "The Black Cat",
    "surface_en": "I killed someone. When the police took me away, I saw the black cat at the door, staring at me. In that moment, I knew I was wrong…",
    "solution_en": "I often saw that black cat downstairs, and when traveling for work, I would leave food for it. That day after returning, I found many dead mice on my balcony. I immediately thought of my quarrelsome neighbor, so I rushed into his house. Amid screams and sirens, I saw the black cat again. It was watching me, with a dead mouse in its mouth…"
  },
  {
    "slug": "the-smile-3",
    "title_en": "The Smile",
    "surface_en": "My dad hated me. He never smiled at me. After my persistent efforts… he finally smiled.",
    "solution_en": "I was an unwanted child. In my society, abandonment was a crime, so my father deeply resented me. Growing up, he never once smiled at me. Later, I became a clown, hoping to make him happy. I kept coming up with new acts, but whenever I performed, he beat or insulted me. This time, he got so angry that he suffered a fatal heart attack…"
  },
  {
    "slug": "washing-my-head-4",
    "title_en": "Washing My Head",
    "surface_en": "I washed my head in the dorm, and then both my roommate and I… died.",
    "solution_en": "I am a robot. Years ago, I had a severe car accident, and my parents built me a mechanical body, preserving only my brain. One day, I saw red oil leaking from my neck. Because of my cleanliness obsession, I removed my head to wash it when the dorm was empty. Unfortunately, my roommate came back and fainted on the spot. Nervous, I accidentally dropped my head into the sink, short-circuiting myself."
  },
  {
    "slug": "the-actress-5",
    "title_en": "The Actress",
    "surface_en": "An actress had a daughter. Since childhood, she often put a hat on her. One day, she took her daughter to the hospital… After learning the truth, the daughter committed suicide.",
    "solution_en": "The actress had once ruined her face. She adopted the daughter to one day transplant her skin onto her own face. The hat was actually hers—she would sometimes put it on her daughter to measure head size. When it finally matched, she took her to the hospital to perform the surgery…"
  },
  {
    "slug": "slept-well-6",
    "title_en": "Slept Well",
    "surface_en": "My brother could never sleep well at night. So, I came up with an idea to let him sleep… When he woke up, he was terrified into madness.",
    "solution_en": "We were very poor, living in a rented room without curtains. My brother, exhausted from work, couldn’t sleep because of the bright lights outside. So I killed a man with thick skin, cut off his skin, and used it to cover the windows. My brother finally slept peacefully. But when he woke up, he saw bloody human skin plastered to the windows, and went mad."
  },
  {
    "slug": "the-surgery-7",
    "title_en": "The Surgery",
    "surface_en": "I was a famous performer in the early 19th century. To become perfect, I had surgery. But soon after, I died.",
    "solution_en": "I was a sideshow performer, famous for my deformities. Rejected all my life, I became addicted to fame and attention. But new sideshow stars stole the spotlight. I couldn’t accept it. I asked a doctor to surgically attach animal parts to me, hoping to become more ‘perfect.’ My body rejected it violently, and I died bitterly."
  },
  {
    "slug": "the-performance-8",
    "title_en": "The Performance",
    "surface_en": "I loved performing. After one play, as my classmates cheered, I knew… this would be my last performance.",
    "solution_en": "I had always loved acting but only played minor roles. At the New Year’s gala, I finally landed the lead. There was one scene that needed a stunt double. I refused to be replaced, so I swapped myself with the mannequin. When the axe fell, I lay on the stage floor, watching my classmates cheer. It was everything I ever wanted. Slowly, the cheers faded, and everything turned black."
  },
  {
    "slug": "favoritism-9",
    "title_en": "Favoritism",
    "surface_en": "I scored 148 in math, and my dad punished me. My sister scored only 36, but he rewarded her and took her swimming. When I asked why, he said: ‘Because you’re not my biological child.’",
    "solution_en": "My sister came from a family of math geniuses. I grew up in an orphanage, then was adopted. Inspired, I excelled in math, and my father placed high expectations on me. For my sister, however, he never taught her math, encouraging her to swim instead. When I questioned the unfairness, he revealed the truth: their family carried a hereditary disease triggered by excessive math ability, causing blindness. The condition only affected daughters, not sons. He hoped I would carry on his mathematical legacy."
  },
  {
    "slug": "the-smile-cabinet-10",
    "title_en": "The Smile (Cabinet)",
    "surface_en": "I hid in the cabinet, watching the police take them away. I smiled.",
    "solution_en": "Two sisters both liked me. To be fair, they dismembered me and split the parts, hiding my head in the cabinet. Luckily, the police later found me. Watching the sisters get arrested, I smiled in relief."
  }
]
