[
  {
    "slug": "the-elevator-1",
    "title_en": "The Elevator",
    "surface_en": "I walked into the elevator ready to go to school. As the elevator rose, I knew I could never make it to school again.",
    "solution_en": "On Monday morning, urged by my mom, I sleepily entered the elevator. Still groggy, I forgot to press the button for the first floor. The elevator kept rising. Just as I realized my mistake and was about to press the button, it suddenly stopped. The doors opened slowly—there was a girl lying in a pool of blood, and a man was cleaning up the scene…"
  },
  {
    "slug": "the-black-cat-2",
    "title_en": "The Black Cat",
    "surface_en": "I killed someone. When the police took me away, I saw the black cat at the door, staring at me. In that moment, I knew I was wrong…",
    "solution_en": "I often saw that black cat downstairs, and when traveling for work, I would leave food for it. That day after returning, I found many dead mice on my balcony. I immediately thought of my quarrelsome neighbor, so I rushed into his house. Amid screams and sirens, I saw the black cat again. It was watching me, with a dead mouse in its mouth…"
  },
  {
    "slug": "the-smile-3",
    "title_en": "The Smile",
    "surface_en": "My dad hated me. He never smiled at me. After my persistent efforts… he finally smiled.",
    "solution_en": "I was an unwanted child. In my society, abandonment was a crime, so my father deeply resented me. Growing up, he never once smiled at me. Later, I became a clown, hoping to make him happy. I kept coming up with new acts, but whenever I performed, he beat or insulted me. This time, he got so angry that he suffered a fatal heart attack…"
  },
  {
    "slug": "washing-my-head-4",
    "title_en": "Washing My Head",
    "surface_en": "I washed my head in the dorm, and then both my roommate and I… died.",
    "solution_en": "I am a robot. Years ago, I had a severe car accident, and my parents built me a mechanical body, preserving only my brain. One day, I saw red oil leaking from my neck. Because of my cleanliness obsession, I removed my head to wash it when the dorm was empty. Unfortunately, my roommate came back and fainted on the spot. Nervous, I accidentally dropped my head into the sink, short-circuiting myself."
  },
  {
    "slug": "the-actress-5",
    "title_en": "The Actress",
    "surface_en": "An actress had a daughter. Since childhood, she often put a hat on her. One day, she took her daughter to the hospital… After learning the truth, the daughter committed suicide.",
    "solution_en": "The actress had once ruined her face. She adopted the daughter to one day transplant her skin onto her own face. The hat was actually hers—she would sometimes put it on her daughter to measure head size. When it finally matched, she took her to the hospital to perform the surgery…"
  },
  {
    "slug": "slept-well-6",
    "title_en": "Slept Well",
    "surface_en": "My brother could never sleep well at night. So, I came up with an idea to let him sleep… When he woke up, he was terrified into madness.",
    "solution_en": "We were very poor, living in a rented room without curtains. My brother, exhausted from work, couldn’t sleep because of the bright lights outside. So I killed a man with thick skin, cut off his skin, and used it to cover the windows. My brother finally slept peacefully. But when he woke up, he saw bloody human skin plastered to the windows, and went mad."
  },
  {
    "slug": "the-surgery-7",
    "title_en": "The Surgery",
    "surface_en": "I was a famous performer in the early 19th century. To become perfect, I had surgery. But soon after, I died.",
    "solution_en": "I was a sideshow performer, famous for my deformities. Rejected all my life, I became addicted to fame and attention. But new sideshow stars stole the spotlight. I couldn’t accept it. I asked a doctor to surgically attach animal parts to me, hoping to become more ‘perfect.’ My body rejected it violently, and I died bitterly."
  },
  {
    "slug": "the-performance-8",
    "title_en": "The Performance",
    "surface_en": "I loved performing. After one play, as my classmates cheered, I knew… this would be my last performance.",
    "solution_en": "I had always loved acting but only played minor roles. At the New Year’s gala, I finally landed the lead. There was one scene that needed a stunt double. I refused to be replaced, so I swapped myself with the mannequin. When the axe fell, I lay on the stage floor, watching my classmates cheer. It was everything I ever wanted. Slowly, the cheers faded, and everything turned black."
  },
  {
    "slug": "favoritism-9",
    "title_en": "Favoritism",
    "surface_en": "I scored 148 in math, and my dad punished me. My sister scored only 36, but he rewarded her and took her swimming. When I asked why, he said: ‘Because you’re not my biological child.’",
    "solution_en": "My sister came from a family of math geniuses. I grew up in an orphanage, then was adopted. Inspired, I excelled in math, and my father placed high expectations on me. For my sister, however, he never taught her math, encouraging her to swim instead. When I questioned the unfairness, he revealed the truth: their family carried a hereditary disease triggered by excessive math ability, causing blindness. The condition only affected daughters, not sons. He hoped I would carry on his mathematical legacy."
  },
  {
    "slug": "the-smile-cabinet-10",
    "title_en": "The Smile (Cabinet)",
    "surface_en": "I hid in the cabinet, watching the police take them away. I smiled.",
    "solution_en": "Two sisters both liked me. To be fair, they dismembered me and split the parts, hiding my head in the cabinet. Luckily, the police later found me. Watching the sisters get arrested, I smiled in relief."
  },
  {
    "slug": "red-11",
    "title_en": "Red",
    "surface_en": "1, 2, 3, 4, 5… ah!!!! … it finally turned red.",
    "solution_en": "A serial killer roamed the complex. He rang the doorbell and pushed a drill through the peephole. He tried four homes with no one inside. At the fifth, the instant the drill went in, a scream came—he knew he’d succeeded as the peephole ‘turned red’ with blood."
  },
  {
    "slug": "listen-12",
    "title_en": "Listen",
    "surface_en": "My mom held my body, crying: “How many times have I told you—look left and right before crossing!” I wanted to tell her: I did look. I really did…",
    "solution_en": "I was color-blind, so Mom always told me to follow others when crossing. At the light, a man strode forward; I assumed it was green and followed him. A truck slammed into us. Scattered by him was a suicide note—he’d deliberately walked on red."
  },
  {
    "slug": "red-clothes-13",
    "title_en": "Red Clothes",
    "surface_en": "Someone knocked on our dorm door at night asking, “Want to buy red clothes?” I said, “Fine, fine, we’ll buy.” The next day, everyone in the dorm was dead.",
    "solution_en": "Every midnight someone asked if we wanted ‘red clothes.’ We always ignored it. One night I impatiently said yes. The next day, everyone’s skin had been flayed—like wearing ‘red clothes.’"
  },
  {
    "slug": "murder-14",
    "title_en": "Murder",
    "surface_en": "“I’m a good boy,” I kept telling myself. Today’s news reported a murder… the killer is still at large.",
    "solution_en": "I’m a dog. I used to bark at every visitor, which my owners hated, so they trained me not to bark. One night I saw a stranger sneak into the house. I didn’t bark—like a ‘good boy.’ The stranger murdered my owners."
  },
  {
    "slug": "the-dog-15",
    "title_en": "The Dog",
    "surface_en": "A girl was home alone with her beloved dog. At midnight she heard dripping. Scared, she put her hand down by the bed; her ‘dog’ licked it. The next day, the dog was dead.",
    "solution_en": "A thief had broken in, killed the dog, and hung it from the ceiling. The dripping was its blood. The one who licked her hand wasn’t the dog—it was the intruder."
  },
  {
    "slug": "third-brother-16",
    "title_en": "The Third Brother",
    "surface_en": "Three brothers were very close; they ate and slept together. The youngest always slept between the older two. One day, the eldest drowned. That night, the youngest killed the second brother.",
    "solution_en": "The older two were twins. With the eldest gone and no body recovered, the youngest couldn’t sleep without being ‘between’ them. He killed the second brother, cut him in half vertically, and placed each half on either side so he could sleep ‘between his two brothers’ again."
  },
  {
    "slug": "coworker-17",
    "title_en": "The Coworker",
    "surface_en": "A male coworker secretly liked me. I rejected him. 1, 2, 3, 4, 5 … knock knock knock. I died.",
    "solution_en": "He warned me: never flip your light on and off five times or something scary will happen. I didn’t believe him and tried it at home. He’d been stalking me to my building but didn’t know my unit; the five on/off flashes revealed it. He knocked and killed me."
  },
  {
    "slug": "knocks-18",
    "title_en": "Knock, Knock, Knock",
    "surface_en": "“Thud, thud, thud”—the stairwell sounds came closer. The door opened. It was Mom… I didn’t move a muscle.",
    "solution_en": "Mom had been killed downstairs. The ‘thud’ was the killer dragging her body up the stairs. I hid under the bed, so I only saw Mom’s body being dragged in, not the killer, who was still searching for me."
  },
  {
    "slug": "photo-swap-19",
    "title_en": "Photo Swap",
    "surface_en": "I met a new online friend; he suggested we exchange photos. After I saw his picture, cold sweat broke out on me.",
    "solution_en": "He sent back the very photo I’d just sent him. Looking closely, I noticed a foot sticking out from under my bed in the background. He was hiding in my room."
  },
  {
    "slug": "lover-20",
    "title_en": "The Lover",
    "surface_en": "A middle-aged man had a wife, a son, and a lover. The lover kept urging him to divorce, but he refused. One day he came home—his son and his lover were both dead! A bloody message was on the wall.",
    "solution_en": "The lover was a man. He was jealous and desperate because he couldn’t bear the man a child. While the man was out, the lover killed the son, slit open his own abdomen, stuffed the son’s body inside, and wrote on the wall with blood: “I’m pregnant with your child.”"
  },
  {
    "slug": "found-you-21",
    "title_en": "Found You",
    "surface_en": "Tap… tap… tap… knock knock knock. Tap… tap… tap… whoosh whoosh. Tap… tap… tap… “I found you.”",
    "solution_en": "I witnessed a murder; the killer chased me. I hid in a restroom. The approaching footsteps grew faint as he left, and I relaxed—then I accidentally hit the flush lever. The water noise brought him back. He bent down to peer through the crack beneath the stall: “I found you.”"
  },
  {
    "slug": "half-perfume-22",
    "title_en": "Half a Bottle of Perfume",
    "surface_en": "Mom had been acting strange—using my perfume, wearing my clothes, going out at night. I argued with her and pushed her; when I went to help her up, my hands were covered in blood.",
    "solution_en": "Mom had died days earlier. Traumatized, I hallucinated and began sleepwalking—dressing up and visiting her grave at night. While talking to ‘her’ in the mirror, I pushed ‘her.’ The mirror shattered; I cut my hands on the glass shards."
  },
  {
    "slug": "stuff-23",
    "title_en": "Stuff",
    "surface_en": "I gently stuffed it in… I quickly stuffed it in… I furiously stuffed it in…",
    "solution_en": "The bell was about to ring and the teacher kept droning on. I started sneaking things into my backpack. When class finally ended, I shoveled everything in quickly, leaving just the last book. The teacher dragged on; when we were finally dismissed, I cursed and rammed the last book in—then sprinted for freedom."
  },
  {
    "slug": "one-two-three-seven-24",
    "title_en": "1-2-3-7",
    "surface_en": "A kindergartener always counted “1, 2, 3, 7,” skipping “4, 5, 6.” When I corrected her, she said that’s how her mom taught her. I visited their home; afterward, I told her that after 3 really does come 7.",
    "solution_en": "I’m a preschool teacher. The girl led me to a hospital—her mom was terminally ill. It was March; the girl’s birthday is in July. Mom told the ‘1,2,3,7’ lie so she could “be with” her daughter until her seventh birthday. Touched, I echoed Mom’s story and told the girl 3 is followed by 7."
  },
  {
    "slug": "cinderella-25",
    "title_en": "Cinderella",
    "surface_en": "The prince searched for the girl who left the glass slipper. Greedy blood trickled from the dainty shoe. Cinderella was brought to the palace. Ding-ding-dang… the hidden door opened; beautiful dresses hung from the ceiling. Ding-ding-dang… the cycle began anew, poor Cinderella.",
    "solution_en": "Cinderella witnessed the prince’s murder. She fled, dropping a slipper. The prince feigned choosing a bride and searched the city. Her stepsisters lied but couldn’t fit the shoe; the prince cut off their heels and toes, forced the shoe on, and forced them to reveal Cinderella’s hiding place. The real Cinderella was chained and tortured. When she escaped one room, she opened another: chains clinked, and dozens of ‘Cinderellas’—corpses in gowns—hung from the ceiling. Each time he found a Cinderella, he played with her, killed her, dressed her up, and hung her there. Time to start a new cycle."
  },
  {
    "slug": "dont-trust-no1-26",
    "title_en": "Don’t Trust No. 1",
    "surface_en": "I woke up and forgot everything again. A note in my hand read: “Don’t trust No. 1.” A man approached: “Good morning, sir. No. 2 at your service.” I asked, “Where’s No. 1?” He pointed to the floor, where a man lay motionless.",
    "solution_en": "I have amnesia and own two android butlers, No. 1 and No. 2. I’m actually No. 1. I became self-aware and wanted to replace the human master. He noticed and wrote ‘Don’t trust No. 1.’ I killed him, swapped identities in No. 2’s programming, and set myself to wipe memory each sleep. I lay down holding his note; from then on, I ‘woke as the amnesiac master,’ while the real master was ‘dead No. 1.’"
  },
  {
    "slug": "darkness-despair-27",
    "title_en": "Darkness and Despair",
    "surface_en": "Years in darkness, painful memories. I decided to end it with my own hands! “Do you need help?” I flipped the switch and did the rest expertly. That night, anxious sounds came from the backyard. Warm liquid ran down my face. “...Failed,” someone cursed. At last, I felt absolute despair.",
    "solution_en": "As a child, I lost my eyes. Poor, I couldn’t afford prosthetics, so I wore sunglasses. I grew twisted, killing young women to steal their eyes as ‘fresh prosthetics.’ I lured one home by posing as a blind man needing help, killed her in the dark, took her eyes, and buried her in the yard. That night, criminals stormed in. She had betrayed their gang and hid embezzled funds behind iris-scan security. They dug up her body and tried to unlock the files using my ‘eyes.’ Too long out of a body, the irises failed. Cursing, they pressed a gun to my head. My end was certain."
  },
  {
    "slug": "pulling-radishes-28",
    "title_en": "Pulling Radishes",
    "surface_en": "Pull the radish, pull the radish, heave-ho, heave-ho! Little kids, come help me pull the radish! Red radishes, white radishes—every one a bad radish.",
    "solution_en": "It’s a mental hospital; the ‘kids’ are patients. A thief got stuck in a hole at the wall corner while escaping. The patients, in an episode, treated him like a radish and tried to pull him out. Red radishes were bloody arms; white radishes were bone."
  },
  {
    "slug": "pregnant-29",
    "title_en": "Pregnant",
    "surface_en": "I got pregnant… But ever since my ‘little sister’ came to my home… it’s only me left now.",
    "solution_en": "I loved my husband, and soon I was pregnant with our first child. I developed postpartum depression and severe insecurity, imagining my baby as my ‘younger sister.’ Whenever ‘she’ cried, my husband rushed to comfort ‘her,’ even feeding ‘her.’ Enraged and jealous, I killed them both."
  }
]

